Update system design article templates
